syfchao/STM32_RTT_F107/components/DeviceDrivers/usart5.c
/*****************************************************************************/
/* File      : usart5.c                                                      */
/*****************************************************************************/
/*  History:                                                                 */
/*****************************************************************************/
/*  Date       * Author          * Changes                                   */
/*****************************************************************************/
/*  2017-06-02 * Shengfeng Dong  * Creation of the file                      */
/*             *                 *                                           */
/*****************************************************************************/

/*****************************************************************************/
/*  Include Files                                                            */
/*****************************************************************************/
#include "usart5.h"	
#include "SEGGER_RTT.h"
#include "timer.h"
#include "string.h"
#include "stm32f10x.h"
#include "rthw.h"
#include "stdio.h"
#include "rtthread.h"
#include "stdlib.h"
#include "debug.h"
#include "client.h"
#include "threadlist.h"
#include "clientSocket.h"
#include "file.h"
#include "datetime.h"
#include "mcp1316.h"
#include "powerIO.h"
#include "InternalFlash.h"


/*****************************************************************************/
/*  Definitions                                                              */
/*****************************************************************************/
rt_mutex_t wifi_uart_lock = RT_NULL;
extern unsigned char APSTA_Status;
eWiFiFileType WiFiFileDownload_Status = WiFiFileNoConnect;
/*****************************************************************************/
/*  Function Implementations                                                 */
/*****************************************************************************/
Socket_Cfg client_arg;
Socket_Cfg control_client_arg;
Socket_Cfg ftp_arg;
Socket_Cfg wifiserver_arg;

void initSocketArgs(void)
{
    char *buff = NULL;
    buff = malloc(512);
    memset(buff,'\0',512);
    ReadPage(INTERNAL_FLASH_CONFIG_INFO,buff,512);

    if(1 == buff[500])	//服务器参数配置成功
    {
    	//初始化电量上传参数
        client_arg.port1 = buff[164]*256 + buff[165];
        client_arg.port2 = buff[166]*256 + buff[167];
        memcpy(client_arg.domain, &buff[100],32);
        memcpy(client_arg.ip,&buff[148],16);
	//初始化远程控制参数
         control_client_arg.port1 = buff[64]*256 + buff[65];
        control_client_arg.port2 = buff[66]*256 + buff[67];
        memcpy(control_client_arg.domain, &buff[0],32);
        memcpy(control_client_arg.ip,&buff[48],16);
        control_client_arg.timeout = buff[68]*256 + buff[69];
        control_client_arg.report_interval = buff[70]*256 + buff[71];
	//初始化FTP服务器参数
        ftp_arg.port1 = buff[264]*256 + buff[265];
        memcpy(ftp_arg.domain, &buff[200],32);
        memcpy(ftp_arg.ip,&buff[248],16);
        memcpy(ftp_arg.user, &buff[266],40);
        memcpy(ftp_arg.passwd,&buff[306],40);

	//初始化无线文件服务器参数
        wifiserver_arg.port1 = buff[416]*256 + buff[417];
        wifiserver_arg.port2 = buff[418]*256 + buff[419];
        memcpy(wifiserver_arg.ip,&buff[400],16);
    }else
    {
        //初始化电量上传参数
        client_arg.port1 = CLIENT_SERVER_PORT1;
        client_arg.port2 = CLIENT_SERVER_PORT2;
        strcpy(client_arg.domain, CLIENT_SERVER_DOMAIN);
        strcpy(client_arg.ip, CLIENT_SERVER_IP);
        //初始化远程控制参数
        control_client_arg.port1 = CONTROL_SERVER_PORT1;
        control_client_arg.port2 = CONTROL_SERVER_PORT2;
        strcpy(control_client_arg.domain, CONTROL_SERVER_DOMAIN);
        strcpy(control_client_arg.ip, CONTROL_SERVER_IP);
        control_client_arg.timeout = 10;
        control_client_arg.report_interval = 15;
        //初始化FTP服务器参数
        ftp_arg.port1 = UPDATE_SERVER_PORT1;
        strcpy(ftp_arg.domain, UPDATE_SERVER_DOMAIN);
        strcpy(ftp_arg.ip, UPDATE_SERVER_IP);
        strcpy(ftp_arg.user, UPDATE_USER);
        strcpy(ftp_arg.passwd, UPDATE_PASSWORD);
        //初始化无线文件服务器参数
        wifiserver_arg.port1 = WIFI_SERVER_PORT1;
        wifiserver_arg.port2 = WIFI_SERVER_PORT2;
        strcpy(wifiserver_arg.ip, WIFI_SERVER_IP);
    }
    
    free(buff);
    buff = NULL;

    //打印服务器
    printf("-----------------------------------------------\n");
    printf("client.domain:%s\n",client_arg.domain);
    printf("client.ip:%s\n",client_arg.ip);
    printf("client.port1:%d\n",client_arg.port1);
    printf("client.port2:%d\n",client_arg.port2);

    printf("control.domain:%s\n",control_client_arg.domain);
    printf("control.ip:%s\n",control_client_arg.ip);
    printf("control.port1:%d\n",control_client_arg.port1);
    printf("control.port2:%d\n",control_client_arg.port2);
    printf("control.timeout:%d\n",control_client_arg.timeout);
    printf("control.report_interval:%d\n",control_client_arg.report_interval);

    printf("ftp.domain:%s\n",ftp_arg.domain);
    printf("ftp.ip:%s\n",ftp_arg.ip);
    printf("ftp.port1:%d\n",ftp_arg.port1);
    printf("ftp.user:%s\n",ftp_arg.user);
    printf("ftp.password:%s\n",ftp_arg.passwd);

    printf("wifiserver.ip:%s\n",wifiserver_arg.ip);
    printf("wifiserver.port1:%d\n",wifiserver_arg.port1);
    printf("wifiserver.port2:%d\n",wifiserver_arg.port2);
	
    printf("-----------------------------------------------\n");
}


/* 随机取port1或port2 */
int randport(Socket_Cfg cfg)
{
    srand((unsigned)acquire_time());
    if(rand()%2)
        return cfg.port1;
    else
        return cfg.port2;
}
//4个字节
unsigned short packetlen_A(unsigned char *packet)
{
    unsigned short len = 0;
    len = ((packet[0]-'0')*1000 +(packet[1]-'0')*100 + (packet[2]-'0')*10 + (packet[3]-'0'));
    return len;
}

//2个字节
unsigned short packetlen_B(unsigned char *packet)
{
    unsigned short len = 0,count = 0;
    count = (packet[0] - '0') * 10 + (packet[1] - '0');
    len =  3 + 9 + count *14;
    return len;

