syfchao/STM32_RTT_F107/components/DeviceDrivers/usart5.c
int AT_CWLAPList(char *liststr)		
{
    int i = 0;
    char AT[100] = { '\0' };
    clear_WIFI();
    sprintf(AT,"AT+CWLAP\r\n");
    printf("%s",AT);
    WIFI_SendData(AT, (strlen(AT)+1));
    for(i = 0;i< 600;i++)
    {
        if(1 == detectionLAPList(Cur,liststr))
        {
            printf("AT+AT_CWLAPList :+ok\n");
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;
}

int AT_CIPMUX1(void)			//设置多连接AT命令
{
    int i = 0;
    clear_WIFI();
    WIFI_SendData("AT+CIPMUX=1\r\n", 13);
    for(i = 0;i< 200;i++)
    {
        if(1 == detectionOK(Cur))
        {
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;
}

int AT_CIPSERVER(void)			//设置多连接AT命令
{
    int i = 0;
    clear_WIFI();
    WIFI_SendData("AT+CIPSERVER=1,8899\r\n", 21);
    for(i = 0;i< 200;i++)
    {
        if(1 == detectionOK(Cur))
        {
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;
}


int AT_CIPSTART(char ConnectID,char *connectType,char *IP,int port)			//配置ECU连接无线路由器名
{
    int i = 0;
    char AT[100] = { '\0' };
    clear_WIFI();
    sprintf(AT,"AT+CIPSTART=%c,\"%s\",\"%s\",%d\r\n",ConnectID,connectType,IP,port);

    WIFI_SendData(AT, (strlen(AT)+1));
    for(i = 0;i< 500;i++)
    {
        if(1 == detectionOK(Cur))
        {
            clear_WIFI();
            return 0;
        }
	if(1 == detectionclose(Cur))
	{
	    clear_WIFI();
            return -1;
	}
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;
}

int AT_CIPCLOSE(char ConnectID)			//配置ECU连接无线路由器名
{
    int i = 0;
    char AT[100] = { '\0' };
    clear_WIFI();
    sprintf(AT,"AT+CIPCLOSE=%c\r\n",ConnectID);
    WIFI_SendData(AT, (strlen(AT)+1));
    for(i = 0;i< 100;i++)
    {
        if((1 == detectionOK(Cur))||(1 == detectionUNLINK(Cur)))
        {
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;
}


int AT_CIPSEND(char ConnectID,int size)			//配置ECU连接无线路由器名
{
    int i = 0;
    char AT[100] = { '\0' };
    clear_WIFI();
    sprintf(AT,"AT+CIPSEND=%c,%d\r\n",ConnectID,size);
    WIFI_SendData(AT, (strlen(AT)+1));
    for(i = 0;i< 200;i++)
    {
        if(1 == detectionOK(Cur))
        {
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;
}

int AT_CIPAP_DEF(void)			//配置ECU连接无线路由器名
{
    int i = 0;
    char AT[100] = { '\0' };
    clear_WIFI();
    sprintf(AT,"AT+CIPAP_DEF=\"10.10.100.254\"\r\n");
    WIFI_SendData(AT, (strlen(AT)+1));
    for(i = 0;i< 200;i++)
    {
        if(1 == detectionOK(Cur))
        {
            printf("AT+AT_CIPAP_DEF :+ok\n");
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;
}

int AT_CIPSTO(void)			//配置WIFI模块作为TCP服务器时的超时时间
{
    int i = 0;
    char AT[100] = { '\0' };
    clear_WIFI();
    sprintf(AT,"AT+CIPSTO=20\r\n");
    //printf("%s",AT);
    WIFI_SendData(AT, (strlen(AT)+1));
    for(i = 0;i< 200;i++)
    {
        if(1 == detectionOK(Cur))
        {
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;
}

int WIFI_Factory(char *ECUID12)
{

    int i = 0,res = 0;

    //选择 WMODE
    for(i = 0;i<3;i++)
    {
        if(0 == AT_CWMODE3(3))
        {
            res = 0;
            break;
        }else
            res = -1;
    }
    if(res == -1) return -1;


    if(!AT_CWSAP(ECUID12,"88888888"))
    {

        //选择 WMODE
        for(i = 0;i<3;i++)
        {
            if(0 == AT_CWMODE3(1))
            {
                res = 0;
                break;
            }else
                res = -1;
        }
        if(res == -1) return -1;
        AT_CIPMUX1();
        /*
        if(0 != AT_RST())
        {
            WIFI_Reset();
        }

        rt_hw_s_delay(1);
        AT_CIPMUX1();
        AT_CIPSERVER();
        AT_CIPSTO();
        */


        return 0;
    }
    else
        return -1;

}

int WIFI_ChangePasswd(char *NewPasswd)
{
    char ECUID[13] = {'\0'};
    get_ecuid(ECUID);
    if(!AT_CWSAP(ECUID,NewPasswd))
        return 0;
    else
        return -1;
}

int InitWorkMode(void)
{
    int i = 0,res = 0;

    //选择 WMODE
    for(i = 0;i<3;i++)
    {
        if(0 == AT_CWMODE3(3))
        {
            res = 0;
            break;
        }else
            res = -1;
    }
    if(res == -1) return -1;


    //配置默认IP
    for(i = 0;i<3;i++)
    {
        if(0 == AT_CIPAP_DEF())
        {
            res = 0;
            break;
        }else
            res = -1;
    }
    if(res == -1) return -1;

    printf("WIFI_InitWorkMode Over\n");

    return 0;
}

#ifdef RT_USING_FINSH
#include <finsh.h>
void Send(char *data, int num)
{
    memset(sendbuff,0x00,4096);
    sprintf(sendbuff,"b00000000");

    memcpy(&sendbuff[9],data,num);

    WIFI_SendData(sendbuff,(num+9));
}
int AT_JAPST(void)
{
    char info[100] = {'\0'};
    int ret = AT_CWJAPStatus(info);
    printf("%s\n",info);
    return ret;
}

void AT_LAPList(void)
{
    char *list = NULL;
    list = malloc(2048);
    memset(list,'\0',2048);
    AT_CWLAPList(list);
    free(list);
}
FINSH_FUNCTION_EXPORT(AT_LAPList ,AT_LAPList)
FINSH_FUNCTION_EXPORT(Send ,WIFI send)


FINSH_FUNCTION_EXPORT(WIFI_Reset , Reset WIFI Module .)


FINSH_FUNCTION_EXPORT(WIFI_SendData ,WIFI_SendData)
FINSH_FUNCTION_EXPORT(AT_CWMODE3 ,AT CWMODE 3)
FINSH_FUNCTION_EXPORT(AT_RST ,AT reset)
FINSH_FUNCTION_EXPORT(AT_CWSAP ,AT_CWSAP)
FINSH_FUNCTION_EXPORT(AT_CWJAP_DEF ,AT_CWJAP_DEF)
FINSH_FUNCTION_EXPORT(AT_CIPMUX1 ,AT_CIPMUX1)
FINSH_FUNCTION_EXPORT(AT_CIPSERVER ,AT_CIPSERVER)

FINSH_FUNCTION_EXPORT(AT_CIPSTART ,AT_CIPSTART)
FINSH_FUNCTION_EXPORT(AT_CIPCLOSE ,AT_CIPCLOSE)
FINSH_FUNCTION_EXPORT(AT_CIPSEND ,AT_CIPSEND)
FINSH_FUNCTION_EXPORT(detectionIPD ,detectionIPD)

FINSH_FUNCTION_EXPORT(AT_CIPAP_DEF ,AT_CIPAP_DEF)
FINSH_FUNCTION_EXPORT(AT_CIPSTO ,AT_CIPSTO)
FINSH_FUNCTION_EXPORT(WIFI_Test ,WIFI_Test)
FINSH_FUNCTION_EXPORT(InitWorkMode ,InitWorkMode)

FINSH_FUNCTION_EXPORT(SendToSocket , Send SOCKET.)
FINSH_FUNCTION_EXPORT(SendToSocketB , Send SOCKET B.)
FINSH_FUNCTION_EXPORT(SendToSocketC , Send SOCKET C.)


FINSH_FUNCTION_EXPORT(AT_JAPST , AT_JAPST.)
#endif

